tutorial/constant/Fluid/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
	format      ascii;
	class       dictionary;
	location    "constant";
	object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  RAS;
RAS
{
	RASModel        kEpsilon;
	turbulence      on;
	printCoeffs     on;
}
LES
{
    model           WALE;
    turbulence      on;
    printCoeffs     on;
    delta           cubeRootVol;
}
// ************************************************************************* //
