tutorial/system/extrudeMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      extrudeMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

constructFrom    patch;

sourceCase       "$FOAM_CASE";
sourcePatches    (front);

exposedPatchName back;

flipNormals      false;

extrudeModel     wedge;

mergeFaces       false;
mergeTol         1e-5;

sectorCoeffs // used by sector and wedge extrusion
{
    axisPt       (0 0.01 0);
    axis         (0 0 1);
    angle        2.5;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
