tutorial/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        action  new;
        type    cellSet;
        name    channel;
        source  boxToCell;
        sourceInfo
        {
            boxes   (
                    (0.04 -1 0.245) (0.1 1 0.255)
                    (0.04 -1 0.495) (0.1 1 0.505)
                    (0.04 -1 0.745) (0.1 1 0.755)
                    ); // Edit box bounds as required
        }
    }

    {
        action  invert;
        type    cellSet;
        name    channel;
        source  patch;
    }
);

// ************************************************************************* //
